EDT/УТ/src/Documents/РасчетСубагентовДополнительный/РасчетСубагентовДополнительный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетСубагентовДополнительный</name>
  <registerRecords>AccumulationRegister.УчетСубагентовДополнительный</registerRecords>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифныйПлан</name>
    <type>
      <types>CatalogRef.ТарифныеПланы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорыСубагентов</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.СубагентскиеДоговоры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоговорыСубагентовКРасчету</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.СубагентскиеДоговоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКРаспределению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДоговора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРаспределенная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>ЮрЛицо</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.СубагентскиеДоговоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Субагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизацияАгент</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>CatalogRef.ТипыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтернетМагазин</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>CatalogRef.новаРезультатМестнойДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНевыполнения</name>
      <type>
        <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусИнтернетМагазина</name>
      <type>
        <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаПереноса</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифнаяСетка</name>
      <type>
        <types>CatalogRef.ТипыТарифов</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияДоставки</name>
      <type>
        <types>CatalogRef.КатегорииДоставки2014</types>
        <types>CatalogRef.КатегорииДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетныйБрейк</name>
      <type>
        <types>CatalogRef.РасчетныеБрейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифнаяСеткаПартнера</name>
      <type>
        <types>CatalogRef.ТарифныеСетки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗонаТарификации</name>
      <type>
        <types>CatalogRef.ГруппыРайонов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйПлан</name>
      <type>
        <types>CatalogRef.ТарифныеПланы</types>
      </type>
    </attributes>
    <attributes>
      <name>РассчитаноПоТарифномуПлану</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОценочная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПолученная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоставкиДоМКАД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоставкиЗаМКАД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УслугиСД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БанковскаяКомиссия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КассовоеОбслуживание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВозврата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Масса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЧастичногоВозврата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплаченоКлиентовНал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АгентскоеВознаграждение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредоплатаПоКредиту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтраховойСбор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поступление</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Списание</name>
      <type>
        <types>DocumentRef.СписаниеТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Оприходование</name>
      <type>
        <types>DocumentRef.ОприходованиеТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Перемещение</name>
      <type>
        <types>DocumentRef.ПеремещениеТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Доставка</name>
      <type>
        <types>BusinessProcessRef.новаМестнаяДоставка</types>
      </type>
    </attributes>
    <attributes>
      <name>Возврат</name>
      <type>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакВозврата</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/РасчетСубагентовДополнительный/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    // Данный фрагмент построен конструктором.
    // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

    // регистр УчетСубагентовДополнительный Приход
    Движения.УчетСубагентовДополнительный.Записывать = Истина;
    Движения.УчетСубагентовДополнительный.Очистить();
    Для Каждого ТекСтрокаЗаказы Из Заказы Цикл
        Движение = Движения.УчетСубагентовДополнительный.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.ЮрЛицо = ТекСтрокаЗаказы.ЮрЛицо;
        Движение.Договор = ТекСтрокаЗаказы.Договор;
        Движение.Субагент = ТекСтрокаЗаказы.Субагент;
        Движение.ОрганизацияАгент = ТекСтрокаЗаказы.ОрганизацияАгент;
        Движение.ТипОплаты = ТекСтрокаЗаказы.ТипОплаты;
        Движение.ИнтернетМагазин = ТекСтрокаЗаказы.ИнтернетМагазин;
        Движение.Реализация = ТекСтрокаЗаказы.Реализация;
        Движение.СтатусЗаказа = ТекСтрокаЗаказы.СтатусЗаказа;
        Движение.ПричинаНевыполнения = ТекСтрокаЗаказы.ПричинаНевыполнения;
        Движение.СтатусИнтернетМагазина = ТекСтрокаЗаказы.СтатусИнтернетМагазина;
        Движение.ПричинаОтказа = ТекСтрокаЗаказы.ПричинаОтказа;
        Движение.ТарифнаяСетка = ТекСтрокаЗаказы.ТарифнаяСетка;
        Движение.КатегорияДоставки = ТекСтрокаЗаказы.КатегорияДоставки;
        Движение.ТипЗаказа = ТекСтрокаЗаказы.ТипЗаказа;
        Движение.РасчетныйБрейк = ТекСтрокаЗаказы.РасчетныйБрейк;
        Движение.ТарифнаяСеткаПартнера = ТекСтрокаЗаказы.ТарифнаяСеткаПартнера;
        Движение.ЗонаТарификации = ТекСтрокаЗаказы.ЗонаТарификации;
        Движение.ТарифныйПлан = ТекСтрокаЗаказы.ТарифныйПлан;
        Движение.РассчитаноПоТарифномуПлану = ТекСтрокаЗаказы.РассчитаноПоТарифномуПлану;
        Движение.СуммаОценочная = ТекСтрокаЗаказы.СуммаОценочная;
        Движение.СуммаПолученная = ТекСтрокаЗаказы.СуммаПолученная;
        Движение.СуммаДоставкиДоМКАД = ТекСтрокаЗаказы.СуммаДоставкиДоМКАД;
        Движение.СуммаДоставкиЗаМКАД = ТекСтрокаЗаказы.СуммаДоставкиЗаМКАД;
        Движение.УслугиСД = ТекСтрокаЗаказы.УслугиСД;
        Движение.БанковскаяКомиссия = ТекСтрокаЗаказы.БанковскаяКомиссия;
        Движение.КассовоеОбслуживание = ТекСтрокаЗаказы.КассовоеОбслуживание;
        Движение.СуммаВозврата = ТекСтрокаЗаказы.СуммаВозврата;
        Движение.Масса = ТекСтрокаЗаказы.Масса;
        Движение.СуммаЧастичногоВозврата = ТекСтрокаЗаказы.СуммаЧастичногоВозврата;
        Движение.ОплаченоКлиентовНал = ТекСтрокаЗаказы.ОплаченоКлиентовНал;
        Движение.АгентскоеВознаграждение = ТекСтрокаЗаказы.АгентскоеВознаграждение;
        Движение.ПредоплатаПоКредиту = ТекСтрокаЗаказы.ПредоплатаПоКредиту;
        Движение.СтраховойСбор = ТекСтрокаЗаказы.СтраховойСбор;
        Движение.Поступление = ТекСтрокаЗаказы.Поступление;
        Движение.Списание = ТекСтрокаЗаказы.Списание;
        Движение.Оприходование = ТекСтрокаЗаказы.Оприходование;
        Движение.Перемещение = ТекСтрокаЗаказы.Перемещение;
        Движение.Доставка = ТекСтрокаЗаказы.Доставка;
        Движение.Возврат = ТекСтрокаЗаказы.Возврат;
        Движение.ПризнакВозврата = ТекСтрокаЗаказы.ПризнакВозврата;
    КонецЦикла;

    //}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
